avi.org
**** TODO External Links

- If the resource is not contained within this document then it is an external link.

***** TODO Add reference to http://orgmode.org/manual/External-links.html#External-links

***** TODO Add reference to http://orgmode.org/manual/Footnotes.html

***** TODO Explain when to use one vs other

* TODO Helper Functions Pre-Provisioning

These are functions used in the configuration and operation of Org-Mode.

They do not rely on installation of any external packages.

#+begin_src emacs-lisp
(defun gcr/save-all-file-buffers (&rest ls)
  "Saves every buffer associated with a file

LS captures arguments when this is used as before advice."
  (interactive)
  (dolist (buf (buffer-list))
    (with-current-buffer buf
      (when (and (buffer-file-name) (buffer-modified-p))
        (save-buffer)))))

(defmacro gcr/on-gui (statement &rest statements)
  "Evaluate the enclosed body only when run on GUI."
  `(when (display-graphic-p)
     ,statement
     ,@statements))

(defmacro gcr/on-gnu/linux (statement &rest statements)
  "Evaluate the enclosed body only when run on GNU/Linux."
  `(when (eq system-type 'gnu/linux)
     ,statement
     ,@statements))

(defmacro gcr/on-osx (statement &rest statements)
  "Evaluate the enclosed body only when run on OSX."
  `(when (eq system-type 'darwin)
     ,statement
     ,@statements))

(defmacro gcr/on-gnu/linux-or-osx (statement &rest statements)
  "Evaluate the enclosed body only when run on GNU/Linux or OSX."
  `(when (or (eq system-type 'gnu/linux)
            (eq system-type 'darwin))
     ,statement
     ,@statements))

(defmacro gcr/on-windows (statement &rest statements)
  "Evaluate the enclosed body only when run on Microsoft Windows."
  `(when (eq system-type 'windows-nt)
     ,statement
     ,@statements))
#+end_src

* TODO Org-Mode Pre-Provisioning

Installation and Configuration of Org-Mode in this heading only uses built-in
libraries and does not use Org-Package.

** TODO Start Up

There are things that must occur during start… *before* everything else.

Load the newer version of a file: bytecode or lisp. This says a lot. In the
users guide it explains why you may want this turned off. That way you can
develop code and try it out to see how it works and comare it to the old version
which had been byte-compiled. I am not doing that here.
#+begin_src emacs-lisp
(setq load-prefer-newer t)
#+end_src

** TODO Run-time

Reproducibility is both the foundation of all good science, and, the thing that
allows us to tell, and enjoy, jokes. This system is a little of both

Paging through hundreds of Emacs related posts in my memory banks, there is a
common decision shared with the reader /not/ to upgrade the Emacs version. This
could be out of laziness, which makes total sense, and another good reason is
that every new release brings change. Despite the fact that we are subject to
decay, which is /just/ change, most humans don't like either. Change often brings
pain, and hard work. To help alleviate some of the pain, this system will
attempt to capture its configuration at a particular state in time to facilitate
reproducibility. In practice, it will be a bit liberal, though.

This system will only start with the correct version of Emacs, v24.4

#+begin_src emacs-lisp
(defun gcr/emacs-version-check ()
  "Enforce version compliance."
  (interactive)
  (when (not (and (= emacs-major-version 24)
              (= emacs-minor-version 4)))
    (error
     "Incorrect Emacs runtime. Expected v24.4. Found v%s.%s"
     (number-to-string emacs-major-version)
     (number-to-string emacs-minor-version))))
(gcr/emacs-version-check)
#+end_src

** TODO Installation

*** TODO Bring in installation decision stuff from ALEC

*** TODO Add reference to installation page

*** TODO Clarify in detail why it is important to run off HEAD, link to accessibility

*** TODO Explain how to make sure that you have the right Org-Mode loaded

A virgin-installation of EMACS comes with Org-Mode already installed. It is stable, reliable, and
predictable. It is a fine software product. AVI needs access to cutting edge features, immediate hot-fixes, and easy patch
creation. The easiest way to do this is the "Using Org's git repository" option. Before you start this set up, find out what
version of Org-Mode is built-in.

Start EMACS with the =-Q= argument so that only the built-libraries are loaded. Open the =*scratch*= buffer and evaluate the
expression =(org-version)=. Note it because the  code will load a newer version of Org-Mode. Quit EMACS.

Follow these instructions in a terminal:
- =cd ~=
- =mkdir src=
- =cd ~/src/=
- =git clone git://orgmode.org/org-mode.git=
- =cd org-mode/=
- =make autoloads=

Load the Org-Mode core distribution.

#+begin_src emacs-lisp
(add-to-list 'load-path "~/src/org-mode/lisp")
#+end_src

Load the Org-Mode-Contributions distribution.

#+begin_src emacs-lisp
(add-to-list 'load-path "~/src/org-mode/contrib/lisp")
#+end_src

Start EMACS normally.

*** TODO Decide if the setup steps should be tangled into a provisioning script to be executed before first-load. Consider
    the OSX provsioning experiment

*** TODO Can't remember the org-contrib package name, get it and update this documentation

*** TODO Should the setup script be idempotent?

** TODO Configuration

There are 3 ways to install Org [fn:6edaf224: http://orgmode.org/manual/Installation.html]:
- ELPA
- Archive
- Git

If you are developing Org, then use Git.

If you are not developing Org, then use ELPA.

*** Discussion

Late into the development process I ran into some export to HTML issues.
After tracking down the source, I learned that tracking down the source of the
issue in the source itself was out of scope for me. My solution was to break out
the org-mode configuration into its own block so that I could generate two
Emacs configuration files. Doing so with a different section was easier, so
that is how I did it. This turned out to be a configuration change. The
solution was to disable =pretty-mode= before exporting.

Tangling can take more than a few minutes; so there is some advice to report on
it just to me understand what is happening and that it is working. Another way
to perform this monitoring would have been to use around advice. What I ran
into is that on HTML export around works fine, but on tangling it did not. This is
something that I chose not to investigate; instead I reverted the tangling
advice to two separate commands and that seems to work fine. Since then two
things have changed:
1) There is a new advice system. Not everything is migrated.
2) Tangling is kept less than 60s. Most of the long tangle times had to do with
   mis-configuration of headings and then re-configuring Org to speed it up.

Org mode, like most of Emacs more powerful modes, slowly grows on you, in
pleasant and intuitive ways. Pretty soon, you fall in love with it. After
using it for 50+ hours or so you start wanting some easier way to navigate than
by typing in the commands over and over (doesn't matter how you re-run them).
Reading the miscellaneous section, I learned about speed keys [fn:40a1962e: http://orgmode.org/manual/Speed-keys.html#Speed-keys] [fn:d064d3d8: http://notesyoujustmightwanttosave.blogspot.com/2011/12/org-speed-keys.html].
Wonderful, just wonderful.

Visualizing hierarchical lists in a flat manner has been fine for me. Sometimes
though I wanted to depth-based view, but didn't think much more of it. Reading
about org-mode, I came upon =org-indent-mode= [fn:20c464a3: http://orgmode.org/manual/Clean-view.html#Clean-view], and decided to give
it a try for a while because it is kind of easier to read. Both modes are
nice, and thus far I'm switching back and forth as I feel like it. Once I
opened my eyes and learned about =org-hide-leading-stars= though, I really
found happiness.

One topic relating to color themes is that of how code should look within
a source block in an org file. There was a thread asking about how to
make the block coloring "better". It was interesting because it revealed my
preference to myself namely that source blocks should be a muted Gray in
the document because it shouldn't draw much attention, but in the editor of
course you get the highlighting that you want. That is my personal
preference, and =org-src-fontify-natively= is still always an option.
Over the past six months (now longer) I think, this approach has worked out well.
Nonetheless I got curious about how things /might/ be with coloring turned on.
Generally, it looks fine. Strangely though, even with the =solarized= theme it is
kind of distracting. Beyond sharing that observation, I won't quantify it any
more than that. The biggest thing for me is that I only want to edit source
blocks in their "real" mode because:
- The real mode is present, and therefore
- All mode specific bindings are present
- Worth mentioning twice because if I don't have helpers on then I will not
  match brackets manually!
  - I've broken code so many times making "quick fixes" and breaking the bracket
    matching it is exhausting
- Sending code to REPLs
- May not sound like much, but those three things are very, very huge in my
  work-flow

The good news is that for doing code reviews and stuff, I can always turn on
that fontification.

On a somewhat similar thread, =(setq org-src-tab-acts-natively t)= would make it
easier to edit source blocks outside of the vehicle offered by =org-edit-src-code=.
Since my intent is never to edit blocks outside for their proper mode though, I
will not enable that. It is tempting to enable it. Pretty sure that there is an
on-list discussion where I asked what it would take to dis-allow editing within
a source block when not in a source buffer. That is an interesting idea. Perhaps
I should pursue that again. Make it explicit that editing code inside source
blocks outside of a source block buffer *can never* /work right/. Until I disallow
editing a source block outside of a source block buffer, this will have to do.

#+begin_src emacs-lisp
(setq org-src-tab-acts-natively nil)
#+end_src

This approach of mine, I think I touch upon it elsewhere… at some point I would
like to refactor this whole document.

This [fn:d58f4050: http://home.fnal.gov/~neilsen/notebook/orgExamples/org-examples.html]
article is really fascinating in that crams a ton of information
into a tiny space. It also is kind of fun to read because it simultaneously
teaches you so many new things, yet at the same time re-teaches or re-educates
you about things that you already knew but didn't know that you could or should
be using in these additional manners.

The HTML export of org documents has an optional JavaScript supported display [fn:49c014be: http://orgmode.org/manual/JavaScript-support.html].
Not sure how I ended up on this, but it is actually a very nice option. The
info style view is nice once you read the directions. The folding interface
is also interesting; I tried out all 3 generation options but didn't find
anything that I specifically liked. Perhaps it is a familiarity or comfort
level with GNU styled docs or the key-bindings.

Don't use =org= for time-tracking, but if I ever do then [fn:0276223e: https://github.com/koddo/org-clock-statusbar-app]
this is nice to know of.

*** Configuration

For this feature to work, it must come /before/ any =org= load statements
#+begin_src emacs-lisp
(setq org-list-allow-alphabetical +1)
#+end_src

