.emacs.el

;; [[file:~/src/avi/avi.org::*Start%20Up][Start\ Up:1]]

(setq load-prefer-newer t)

;; Start\ Up:1 ends here

;; [[file:~/src/avi/avi.org::*Run-time][Run-time:1]]

(defun gcr/emacs-version-check ()
  "Enforce version compliance."
  (interactive)
  (when (not (and (= emacs-major-version 24)
              (= emacs-minor-version 4)))
    (error
     "Incorrect Emacs runtime. Expected v24.4. Found v%s.%s"
     (number-to-string emacs-major-version)
     (number-to-string emacs-minor-version))))
(gcr/emacs-version-check)

;; Run-time:1 ends here

;; [[file:~/src/avi/avi.org::*Explain%20how%20to%20make%20sure%20that%20you%20have%20the%20right%20Org-Mode%20loaded][Explain\ how\ to\ make\ sure\ that\ you\ have\ the\ right\ Org-Mode\ loaded:1]]

(add-to-list 'load-path "~/src/org-mode/lisp")

;; Explain\ how\ to\ make\ sure\ that\ you\ have\ the\ right\ Org-Mode\ loaded:1 ends here

;; [[file:~/src/avi/avi.org::*Explain%20how%20to%20make%20sure%20that%20you%20have%20the%20right%20Org-Mode%20loaded][Explain\ how\ to\ make\ sure\ that\ you\ have\ the\ right\ Org-Mode\ loaded:1]]

(add-to-list 'load-path "~/src/org-mode/contrib/lisp")

;; Explain\ how\ to\ make\ sure\ that\ you\ have\ the\ right\ Org-Mode\ loaded:1 ends here

;; [[file:~/src/avi/avi.org::*Discussion][Discussion:1]]

(setq org-src-tab-acts-natively nil)

;; Discussion:1 ends here

;; [[file:~/src/avi/avi.org::*Configuration][Configuration:1]]

(setq org-list-allow-alphabetical +1)

;; Configuration:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(require 'org)
