avi.org
**** Org

=org= chose not to =autoload= everything. The most noticeable
things in the require statements for =org= are that:
- Only a few exporters come built, so you need to require them
- =htmlize= is required for pretty HTML export of code

#+begin_src emacs-lisp
(require 'org)
(require 'ox-beamer)
(require 'ox-md)
(require 'htmlize)
#+end_src

While [[https://github.com/yjwen/org-reveal][org-reveal]] looks pretty nice, the motion sickness it causes is
unacceptable! Sticking with Beamer for now.

Exports to Confluence are very helpful.

#+begin_src emacs-lisp
(require 'ox-confluence)
#+end_src

=htmlize= should eventually be moved out of this =org= block into its own re-usable
section. It does need configuring both for =org= and also for general use. I like
to be able to copy-and-paste its generated HTML into other documents, and =css= is
the easiest way to achieve it. At some future date, it would be nice to develope
a proper style sheet to handle any situation. The problem is that right now I don't
have enough situations to base a design on, just the desire to do so.

My preference for styling HTML documents has been the same as all printable
documents: black and white. When you do a =htmlize= export in batch-mode, there is
no buffer style information to be exported, so you get nice black-and-white code
formatting. This is an acceptable approach, but I am getting close to setting up
a style to produce just what I want for HTML export. It is close enough to almost
require investment to address it. Apparently I wasn't as close as I had thought,
because there is still no custom stylesheet.

#+begin_src emacs-lisp
(setq htmlize-output-type 'inline-css)
(setq org-html-htmlize-output-type htmlize-output-type)
#+end_src

Building =org= documents is intimately tied to the =org= version, so verify it is
what we expect.
#+begin_src emacs-lisp
(defconst gcr/org-version "8.3beta")

(defun gcr/warn-org-version ()
  "Warn of org misconfiguration."
  (interactive)
  (when (not (version= (org-version) gcr/org-version))
    (warn "Insufficient org-mode requirements. Expected %S. Found: %S " gcr/org-version (org-version))))
(gcr/warn-org-version)
#+end_src

Make sure that exported files are Unicode UTF-8.
#+begin_src emacs-lisp
(setq org-export-coding-system 'utf-8)
#+end_src

Do not preserve line-breaks when exporting instead let the destination
format handle it as it sees fit. This doesn't work like I had expected and makes
me wonder what I am confused about here. When I export to HTML text containing
linebreaks no longer has linebreaks. This is what I expect. When I export that
same text to a buffer though, the line breaks are included. Currently I use
=sacha/unfill-paragraph= on that code.
#+begin_src emacs-lisp
(setq org-export-preserve-breaks nil)
#+end_src

My personal TODO workflow is pretty tame, and it is defined below.

#+begin_src emacs-lisp
(setq org-todo-keywords
      '((sequence "TODO" "IN-PROGRESS" "BLOCKED" "REVIEW" "DONE")))
#+end_src

When running in a GUI, I would like linked images to be displayed inside of
Emacs.
#+begin_src emacs-lisp
(setq org-startup-with-inline-images (display-graphic-p))
#+end_src

When exporting anything, do not insert the exported content into the kill ring.
#+begin_src emacs-lisp
(setq org-export-copy-to-kill-ring nil)
#+end_src

Use =ido= completion in =org=.
#+begin_src emacs-lisp
(setq org-completion-use-ido +1)
(setq org-outline-path-complete-in-steps nil)
(setq org-completion-use-iswitchb nil)
#+end_src

=org= lets you use single letter commands to do stuff on headers. I like to use
=c= for cycling the header expansion.
#+begin_src emacs-lisp
(setq org-use-speed-commands +1)
#+end_src

Ask before execution of shell links. This may look inconsistent given that I allow
evaluation. It just looks inconsistent.
#+begin_src emacs-lisp
(setq org-confirm-shell-link-function 'y-or-n-p)
#+end_src

Ask before execution of emacs-lisp links. This may look inconsistent given that
I allow evaluation. It just looks inconsistent.
#+begin_src emacs-lisp
(setq org-confirm-elisp-link-function 'y-or-n-p)
#+end_src

Make sure that incomplete TODO entries prevent the enclosing parent from every
turning to DONE.
#+begin_src emacs-lisp
(setq org-enforce-todo-dependencies +1)
#+end_src

Use a real ellipsis to render an ellipsis for =org= stuff like showing that a
header is collapsed.
#+begin_src emacs-lisp
(setq org-ellipsis "…")
#+end_src

It is easy to see indentation of headlines without having to count asertisks, so
don't show them, only show the significant and last one.
#+begin_src emacs-lisp
(setq org-hide-leading-stars +1)
#+end_src

Display emphasized text as you would in a WYSIWYG editor.
#+begin_src emacs-lisp
(setq org-fontify-emphasized-text +1)
#+end_src

Use Unicode characters to visualize things like right arrow eg \rarr . Most of those
symbols are correctly exported to the destination format. The most obvious is
this example in LaTeX versus Text.
#+begin_src emacs-lisp
(setq org-pretty-entities +1)
#+end_src

Highlight LaTeX and related markup.
Normally, I don't do any syntax highlighting, as I believe that should be
delegated to source buffers, thinking that to do otherwise is distracting.
However, I already do configure subscripts and Greek letters to be displayed
with syntax highlighting, because I want to indicate to the human reader that
they are special, and specifically /not/-Unicode. Do the same thing for LaTeX
and related markup.
#+begin_src emacs-lisp
(setq org-highlight-latex-and-related '(latex script entities))
#+end_src

Footnote management is an important topic. Thanks to Richard [fn:44cb98d6: https://lists.gnu.org/archive/html/emacs-orgmode/2014-04/msg00172.html], there
is a concise approach for this, which I've pasted here, along with my original
question. What I was experiencing was that numbered footnotes became impossible
to move around. The details, I don't recall as I write this, but I do have more
about it here.

#+begin_example
Context: migrating some contents from one org document into another.
This is kind of a re-factoring thing where none of it will be reused.

Goal: Easily copy and paste sections of text along with footnote
references into the new document, and in doing so, add the contents of the
previous document to the new document, and let org deal with the new footnote
names.

As I write this, I realize that it isn't so simple. I'm just looking
for a place to start in terms of what is already present and how you deal
with it currently.
#+end_example

#+begin_example
I use the inline footnote syntax [fn:: ...] for just this reason.  I
think easy migration of non-inline footnotes would be a nice feature to
add to Org, though doing it right would be non-trivial.

A strategy that another user once described to me for dealing with this
problem is the following:

1) Use a regexp search and replace to re-number the footnotes
   in the region of the text you want to move, giving them high numbers
   (e.g., prefixing each with "9999").
2) Use Org to re-sort the footnotes in the original file, so that the
   newly-renumbered footnotes all appear at the end.
3) Move the text and the footnotes to the new file, which should now be
   easy, since the footnotes are all grouped together.
4) In the new file, use Org to re-number the footnotes back to something
normal.

This sounded like a pretty good idea to me, though I haven't had a need
to try it myself.

Hope that helps!

Best,
Richard
#+end_example

As I recall, it is impossible to move footnotes to new documents. I called it
"refactoring". They were strongly tied to that one document in that one place.
The following settings "fixed" that.

#+begin_src emacs-lisp
(setq org-footnote-define-inline +1)
(setq org-footnote-auto-label 'random)
(setq org-footnote-auto-adjust nil)
(setq org-footnote-section nil)
#+end_src

This is an amazingly easy way to screw up your document. The more you edit
org docs, the more you realize how you must truly protect it:
#+begin_src emacs-lisp
(setq org-catch-invisible-edits 'error)
#+end_src

Though I am not delving deep, it is hard not to want to customize some stuff
and perhaps this is the start. Even though I enabled this, I don't think that I
ever used it.
#+begin_src emacs-lisp
(setq org-loop-over-headlines-in-active-region t)
#+end_src

By default I never want a table of contents generated. It is so easy to enable
it with a property, it will be fine to turn it off.
#+begin_src emacs-lisp
(setq org-export-with-toc nil)
#+end_src

It is /almost always/ faster to work with org documents when they are fully
expanded. Anyway, the structure cycling makes it really, really easy to get an
/outline view/ again.
#+begin_src emacs-lisp
(setq org-startup-folded "nofold")
#+end_src

When images are displayed in the buffer, display them in their actual size. As
the operator, I want to know their true form. Any modifications required for
export will be stated explicitly.
#+begin_src emacs-lisp
(setq org-image-actual-width t)
#+end_src

Hide the delimeter for emphasized text. This may break table alignment. WYSIWYG.
#+begin_src emacs-lisp
(setq org-hide-emphasis-markers +1)
#+end_src

Realign tables automatically.
#+begin_src emacs-lisp
(setq org-startup-align-all-tables +1)
#+end_src

Sacha implemented a nice feature to export Unicode checkboxes correctly from
=org=. That will get into the release. Use the workaround and warn when it is no
longer needed. Now it is in the release. Thanks Sacha and =org= team!

#+begin_src emacs-lisp
(setq org-html-checkbox-type 'unicode)
#+end_src

Before exporting to PDF, save all buffers to make sure that everything is a
known good state.
#+begin_src emacs-lisp
(defadvice org-latex-export-to-pdf (before before-org-latex-export-to-pdf activate)
  (gcr/save-all-file-buffers))
#+end_src

Allow the mouse to do =org= things like expand and collapse headings.

#+begin_src emacs-lisp
(gcr/on-gui
 (require 'org-mouse))
#+end_src

