.emacs.el
(require 'ox-beamer)
(require 'ox-md)
(require 'htmlize)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(require 'ox-confluence)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq htmlize-output-type 'inline-css)
(setq org-html-htmlize-output-type htmlize-output-type)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(defconst gcr/org-version "8.3beta")

(defun gcr/warn-org-version ()
  "Warn of org misconfiguration."
  (interactive)
  (when (not (version= (org-version) gcr/org-version))
    (warn "Insufficient org-mode requirements. Expected %S. Found: %S " gcr/org-version (org-version))))
(gcr/warn-org-version)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-export-coding-system 'utf-8)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-export-preserve-breaks nil)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-todo-keywords
      '((sequence "TODO" "IN-PROGRESS" "BLOCKED" "REVIEW" "DONE")))

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-startup-with-inline-images (display-graphic-p))

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-export-copy-to-kill-ring nil)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-completion-use-ido +1)
(setq org-outline-path-complete-in-steps nil)
(setq org-completion-use-iswitchb nil)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-use-speed-commands +1)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-confirm-shell-link-function 'y-or-n-p)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-confirm-elisp-link-function 'y-or-n-p)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-enforce-todo-dependencies +1)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-ellipsis "…")

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-hide-leading-stars +1)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-fontify-emphasized-text +1)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-pretty-entities +1)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-highlight-latex-and-related '(latex script entities))

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-footnote-define-inline +1)
(setq org-footnote-auto-label 'random)
(setq org-footnote-auto-adjust nil)
(setq org-footnote-section nil)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-catch-invisible-edits 'error)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-loop-over-headlines-in-active-region t)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-export-with-toc nil)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-startup-folded "nofold")

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-image-actual-width t)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-hide-emphasis-markers +1)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-startup-align-all-tables +1)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(setq org-html-checkbox-type 'unicode)

;; Org:1 ends here

;; [[file:~/src/avi/avi.org::*Org][Org:1]]

(defadvice org-latex-export-to-pdf (before before-org-latex-export-to-pdf activate)
  (gcr/save-all-file-buffers))

;; Org:1 ends here
