avi.org
***** Core Babel Configuration

There is a performance issue with tangling when header property inheritance is
enabled. Eric explained that [fn:419e4704: https://lists.gnu.org/archive/html/emacs-orgmode/2014-06/msg00719.html]
there may be performance gains if some of the header properties are not
considered. The list below defines what will be allowed, and everything else
will be removed. With only six properties you sure can do a *lot*. This did help.
When I migrated to AVI tangling got faster. Then I decided that it wasn't worth
any bit of sacrifice of expressivity in Org-Mode so I quit disabling *any* header
properties.

Utility functions follow.

#+begin_src emacs-lisp
(defun gcr/set-org-babel-default-header-args (property value)
  "Easily set system header arguments in org mode.

PROPERTY is the system-wide value that you would like to modify.

VALUE is the new value you wish to store.

Attribution: URL `http://orgmode.org/manual/System_002dwide-header-arguments.html#System_002dwide-header-arguments'"
  (setq org-babel-default-header-args
        (cons (cons property value)
              (assq-delete-all property org-babel-default-header-args))))

(defun gcr/set-org-babel-default-inline-header-args (property value)
  "See `gcr/set-org-babel-default-header-args'; same but for inline header args."
  (setq org-babel-default-inline-header-args
        (cons (cons property value)
              (assq-delete-all property org-babel-default-inline-header-args))))

(defun gcr/set-org-babel-default-header-args:R (property value)
  "See `gcr/set-org-babel-default-header-args'; same but for R.

This is a copy and paste. Additional languages would warrant a refactor."
  (setq org-babel-default-header-args:R
        (cons (cons property value)
              (assq-delete-all property org-babel-default-header-args:R))))

(defun gcr/ispell-org-header-lines-regexp (h)
  "Help ispell ignore org header lines."
  (interactive)
  (cons (concat "^#\\+" h ":") ".$"))

(defun gcr/ispell-a2isra (block-def)
  "Add to the ispell skip region alist the BLOCK-DEF."
  (interactive)
  (add-to-list 'ispell-skip-region-alist block-def))
#+end_src

****** Comments [fn:1e1a7e1f: http://orgmode.org/manual/comments.html#comments]

There is always a question of how to instill traceability in your artifacts. =org=
provides =:comments= for that. Tangling with that value set to =link=,
for example, would add a prefix and postfix comment to the tangled file with the
name of the header from which the generated file was tangled. When I tangle the
.emacs.el, then it puts something like this for that:
#+begin_quote
~;; [[file:~/git/bitbucket-grettke/home/TC3F.org::*Fully%20Loaded%20System][Fully\ Loaded\ System:1]]~

file contents go here

;; Fully\ Loaded\ System:1 ends here
#+end_quote
When you follow the link, it will take you right back to the block that
specified the tangling of the document. That is a start, though not super for
tracking down details of where the code snippets really originated down to the
source blocks themselves.

Speaking of tracibility, this post [fn:16e26884: http://comments.gmane.org/gmane.emacs.orgmode/32814]
explains another approach:

#+begin_example
I've just added functions for detangling code from pure source code
files back into code blocks in the org-mode files from whence they were
tangled.  This is done by the new `org-babel-detangle' function.
Additionally the new `org-babel-tangle-jump-to-org' function can be used
to navigate from a pure source code file back to the related code block
in the original Org-mode file.

Both of these new functions require that the code block was tangled with
comments which can be accomplished by setting the :comments header to
"yes".

This should be useful for collaborating with anyone who would rather
edit source-code files directly rather than keeping the canonical
versions of all source-code in Org-mode files.  You'll just have to
convince your collaborators to leave the link comments in the source
code file.
#+end_example

Trying to understand the other settings, I found =both= to look like this:
#+begin_quote
;; Fully Loaded System
;; Convert decisions into a runnable system.

~;; [[file:~/git/bitbucket-grettke/home/TC3F.org::*Fully%20Loaded%20System][Fully\ Loaded\ System:1]]~

file contents go here

;; Fully\ Loaded\ System:1 ends here
#+end_quote

=noweb= looks like, well I'm going to put a couple examples, because this
is the best setting. This provides was 99% of org mode literate programmers
want which is traceability back from every tangled piece of code to the original
document.
#+begin_quote
;; [[file:~/git/bitbucket-grettke/home/TC3F.org::*Windows%20%5Bfn:38%5D][nil]]
;; [[file:~/git/bitbucket-grettke/home/TC3F.org::*Windows%20%5Bfn:38%5D][nil]]
;; [[file:~/git/bitbucket-grettke/home/TC3F.org::*Frames%20%5Bfn:46%5D][nil]]
#+end_quote
After all of this research, I found that doing noweb-ref tangling, the source
locations are not included, so it is no very useful to include comments, and
I removed them, at least for now. I am not sure how I want to use them right
now.

The type of information that you provide as meta-data is up to you and depends
upon your mental model for your org document. My mental model is mostly to use
headings as the logical area for addressing a particular /concern/ satisfied by
that portion of my Emacs configuration, so the tangling comments reflect that.
In other words, in this document at least, I rarely name source blocks because
the header name is the "true name", and closing the tangle comment with the
source block name is really confusing because it usually is =nil=. The org
links are fine, too, because they convey all of the necessary information
whether you are using org or not. It is more likely that most readers will not
use org links, so they come second.

As it happens, that didn't really work out as I had hoped. The =link= style
works, and =noweb= does not. Not sure why and not digging further, so sticking
with that. Also, I had customized the links, and did that incorrectly, so I
removed those, too. When Eric said that one part of it wasn't implemented, I
didn't to dig into what was working anymore than I had already because it has
already been many hours invested.

Now I've got weeks invested and I'm shocked to find that using links in the
tangled file is worse then useless, it is actually harmful. It just doesn't
help, atleast in the sytems that I am tangling. As such I am no longer using
it.

Well, just read a post of another person using it (many months after I retired
it), and I think that I want to try keeping it around. My problem was probably
between my keyboard and chair so I will give it another go.
#+begin_src emacs-lisp
(gcr/set-org-babel-default-header-args :comments "noweb")
#+end_src

****** Results [fn:1625d11f: http://orgmode.org/manual/results.html#results]

Always display results like you would seem them in a REPL, replacing theme each
time you evaluate the block.
#+begin_src emacs-lisp
(gcr/set-org-babel-default-header-args :results "output replace")
#+end_src

****** Exports [fn:7dad95aa: http://orgmode.org/manual/exports.html#exports]

Include both code blocks and results in exports. This is not saying that the
blocks will be evaluated on export; this is only saying that these two things,
their representation, will be included in the export.
#+begin_src emacs-lisp
(gcr/set-org-babel-default-header-args :exports "both")
#+end_src

****** Noweb [fn:3da67e2d: http://orgmode.org/manual/noweb.html#noweb]

Expand noweb references before the block is tangled or evaluated, but no
exported. This embraces the notion that you are telling the right thing to the
computer and the right thing to the human. This is the only proper setting to
do so. Code is code for the "computer". Code is symbolic for the human reader.

#+begin_src emacs-lisp
(gcr/set-org-babel-default-header-args :noweb "no-export")
#+end_src

****** Padline [fn:508104fc: http://orgmode.org/manual/padline.html]

Deals with inserted code blocks and whether or not you have padding around
them. For a while I liked that, to make it easier to see. Then I used comments
to make it clear, but I may or may not use them. Finally, I decided that not to
make it easier for that form of the code to read for humans, because that is
what the LP document is for.

After doing that, which totally made sense, I decided to give tangle comments a
go again, and although we are still generating for a computer, it can be nice
when =de-tangling= to have some space.

Reading the documentation, I see that this setting is required for
=org-babel-tangle-jump-to-org= to work.

#+begin_src emacs-lisp
(gcr/set-org-babel-default-header-args :padline "yes")
#+end_src

This /may/ interact with a setting I've got above to remove empty prefix and
postfix lines in source blocks.

****** Eval [fn:f6ab36a6: http://orgmode.org/manual/eval.html#eval]

This is probably the single most important configuration parameter for your
document's source blocks. Initially, that value is obscured by the need to
configure the rich variety of other options though, and this parameter is often
visited during the second eighty percent of your investment in =org-babel= when
you are "in the thick" of it.

Still trying to make sense of it all myself, I am adhering to a lightweight
user-story driven configuration of this feature, as I believe that it is the
only way that it will make sense to me. The key goal here for me is to:

- Define typical usage scenarios
- Identify key traits
- Realize those traits in my workflow

The current configuration is more like:
- Default allows for super fast code execution, storing the results
- Any form of reproducible research

******* Story A: Messages

20% of my time spent composing email or mailing list messages. Those messages
may be composed of plain text with some nice markup. They also might have
references and citations. The big value comes with superb code block definition
and execution facilities. Those messages are short-lived; they are never stored
in =git= and unlikely to even end up on the file-system.

My work-flow here is:
- Compose the =org= document
- Prepare necessary buffers for code evaluation
- Execute (weave) source blocks and store the results within the document
- Export to the destination format

******* Story B: Notes

40% of my time is spent taking notes. It is so delightful to do so here. A lot
of those notes are for programming languages so the workflow is nearly identical
to =A=. The actions for navigating among source blocks is used all
of the time to quickly navigate the document's source code, reflecting more
thoughtfulness while working with the document. There is more concern here,
because the document is stored in =git= and long-lived, it will be published
many times. An important approach here is that I like to make a clear and
concise distinction of the responsibilities of tangling and exporting because I
don't like surprises. I want to know how source blocks results were generated,
and when, as well as details about the export itself. This is a scope
restriction that opens up space to make better sense of the workflow of the
document itself. At its simplest, I just want to see a date-time showing when
the document was published for example.

My workflow here is:
- Compose the =org= document
- Prepare necessary buffers for code evaluation
- Execute (weave) source blocks and store the results within the document
- Export to the destination format
  - Evaluate in-line source code relevant to that particular exportation
  - These two distinct phases demonstrate when the document is modified
    - At execute time: results are stored for every non-inline source block
    - At export time: results are included in the exported document for every
      inline source block

