.emacs.el

;; [[file:~/src/avi/avi.org::*Core%20Babel%20Configuration][Core\ Babel\ Configuration:1]]

(defun gcr/set-org-babel-default-header-args (property value)
  "Easily set system header arguments in org mode.

PROPERTY is the system-wide value that you would like to modify.

VALUE is the new value you wish to store.

Attribution: URL `http://orgmode.org/manual/System_002dwide-header-arguments.html#System_002dwide-header-arguments'"
  (setq org-babel-default-header-args
        (cons (cons property value)
              (assq-delete-all property org-babel-default-header-args))))

(defun gcr/set-org-babel-default-inline-header-args (property value)
  "See `gcr/set-org-babel-default-header-args'; same but for inline header args."
  (setq org-babel-default-inline-header-args
        (cons (cons property value)
              (assq-delete-all property org-babel-default-inline-header-args))))

(defun gcr/set-org-babel-default-header-args:R (property value)
  "See `gcr/set-org-babel-default-header-args'; same but for R.

This is a copy and paste. Additional languages would warrant a refactor."
  (setq org-babel-default-header-args:R
        (cons (cons property value)
              (assq-delete-all property org-babel-default-header-args:R))))

(defun gcr/ispell-org-header-lines-regexp (h)
  "Help ispell ignore org header lines."
  (interactive)
  (cons (concat "^#\\+" h ":") ".$"))

(defun gcr/ispell-a2isra (block-def)
  "Add to the ispell skip region alist the BLOCK-DEF."
  (interactive)
  (add-to-list 'ispell-skip-region-alist block-def))

;; Core\ Babel\ Configuration:1 ends here

;; [[file:~/src/avi/avi.org::*Comments%20%5Bfn:1e1a7e1f:%20http://orgmode.org/manual/comments.html#comments%5D][Comments\ \[fn:1e1a7e1f:\ http://orgmode\.org/manual/comments\.html\#comments\]:1]]

(gcr/set-org-babel-default-header-args :comments "noweb")

;; Comments\ \[fn:1e1a7e1f:\ http://orgmode\.org/manual/comments\.html\#comments\]:1 ends here

;; [[file:~/src/avi/avi.org::*Results%20%5Bfn:1625d11f:%20http://orgmode.org/manual/results.html#results%5D][Results\ \[fn:1625d11f:\ http://orgmode\.org/manual/results\.html\#results\]:1]]

(gcr/set-org-babel-default-header-args :results "output replace")

;; Results\ \[fn:1625d11f:\ http://orgmode\.org/manual/results\.html\#results\]:1 ends here

;; [[file:~/src/avi/avi.org::*Exports%20%5Bfn:7dad95aa:%20http://orgmode.org/manual/exports.html#exports%5D][Exports\ \[fn:7dad95aa:\ http://orgmode\.org/manual/exports\.html\#exports\]:1]]

(gcr/set-org-babel-default-header-args :exports "both")

;; Exports\ \[fn:7dad95aa:\ http://orgmode\.org/manual/exports\.html\#exports\]:1 ends here

;; [[file:~/src/avi/avi.org::*Noweb%20%5Bfn:3da67e2d:%20http://orgmode.org/manual/noweb.html#noweb%5D][Noweb\ \[fn:3da67e2d:\ http://orgmode\.org/manual/noweb\.html\#noweb\]:1]]

(gcr/set-org-babel-default-header-args :noweb "no-export")

;; Noweb\ \[fn:3da67e2d:\ http://orgmode\.org/manual/noweb\.html\#noweb\]:1 ends here

;; [[file:~/src/avi/avi.org::*Padline%20%5Bfn:508104fc:%20http://orgmode.org/manual/padline.html%5D][Padline\ \[fn:508104fc:\ http://orgmode\.org/manual/padline\.html\]:1]]

(gcr/set-org-babel-default-header-args :padline "yes")

;; Padline\ \[fn:508104fc:\ http://orgmode\.org/manual/padline\.html\]:1 ends here
