avi.org
******* Story C: Documents

40% of my time is spent managing documents. In my case, it is this document.
There are others, but they are minute in comparison. This is the storehouse,
proving ground, and production deployment environment for every thought, idea,
dream, and goal that I can come up with in regards to ALEC. It shares the same
traits as =A= and =B=, and adds many more.

The first addition is the utilization of =no-web= to tangle source code and also
tangle executable source code. The document evolution has relied heavily upon
this feature. It has allow amazing flexibility. It is so critical that it must
always be available.

The second addition is a different scope of concern. My desire to make the
tangling and exportation of this document more controlled. Unsure,
I waver between restricting evaluation of code blocks by default and enabling
over the entire document and simply allowing it globally. I don't like
accidentally evaluating source blocks and getting their results, but I suppose
that I may rely upon my commits to reveal my error. I suppose that my big
takeaway here is that I want it simple, and want to be able to lock things down
if necessary.

******* Study

Studying the scenarios, the desires seem clear. There is a combination of
agility and scope that ought to make productivity go up. The essence may be
better expressed in terms of responsibilities based upon my preferences
expressed above:

- A document is responsible for
  - Defining source blocks
  - Configuring their execution environments
  - Displaying their results
- Execution of this document is responsible for
  - Evaluating source blocks
  - Collecting results of evaluation
- Tangling is responsible for combining source blocks
  - In this file
    - For output blocks
    - For inclusion in source definitions used in function calls
  - In a new file
- Exporting is responsible for
  - Converting this document to a new presentation format
  - Only in-line source blocks may be evaluated during exporatation
    - Be explicit about the difference eg
      - Execution results as stored in the document
      - Exportation results are stored in the export document
      - Key difference for people to make sense of things

******* Preface to Tooling

The next task is to convert the studies desired into a configuration to realize
them. At first blush the configuration options will seem confusing. The best
approach is to "play" with the configurations to learn and finalize your
approach. That is how I ended up with this configuration. All of the
configuration it based upon that combination of need and desire and how the
system itself works. At best, it will only make sense in this context. Over
time, it will make more sense. That period of evolution and growth is reflected
in the =org= documentation itself for example when you read about =ditaa= in regards
to exporting [fn:14fb5203: http://orgmode.org/manual/Exporting-code-blocks.html].
The more familiar and comfortable with =org= one becomes, the more sense mentions
such as that make.

******* A More Concise Goal (Making Sense of Things)

This facilitate my personal model for =LP= with =org= for evaluation modes. There
are only two of them, =A= and =B=.

Mode =A= allow execution to occur where the results are likely to be captured
within the document. The single responsibility of that mode is to perform and
capture the entirety of the computation. That really sums it up. All computation
is done here because it is time and context sensitive. The document in that form
will serve as a snapshot in time. If you run ℝ code then capture the results and
plots and also the version of itself and the packages used. If you have
versioned links for your data set, then report it here. Think of future users
of your research as archeologists trying to piece together what you did; you
should make their job really easy. This is a self contained computational unit,
and its results, too. Include everything that matters for your computation.
Consider Vagrant [fn:28698f18: http://www.vagrantup.com/] regardless of how much
slower it may run on a virtual. How you defined this document and computed it
and captured and the results are all *one* thing that needs to both be considered
and captured in its entirety.

Mode =B= is a little simpler. All of the hard work has been done. Everything just
mentioned has been done. This is purely responsible for publishing. Perhaps you
want to submit it to a journal, that is publishing. Perhaps you want to post it
on a blog, that is publishing. Publishing has different concerns. You want to
know about the environment used to perform the publishing, like the tools and
the time. Perhaps you want to more about the computer is was published on. All
of those aspects unique to that event of publishing should be included during
export. The operator really needs to get on-board with the idea of
/computational artifacts/ vs /publishing artifacts/.
For example if you execute mode =A= then you need to store all of its generated artifacts. That includes data, but also
graphics that you reference in the document itself. Hopefully you are
questioning my claim here. You should! You area asking "Why should I when I
can reproduce the results?!". Great question. The answer only makes sense
according to the philosophy I am embracing. Mode =A= defines both the computational
unit and its constituent output. That is a single /thing/, a single /thing document/.
Now that I am writing this, I am having questions about my claim here, and I will
explore them as my understanding is bettered. For now, I am sticking with this
because for example I know that I can use PNG anywhere. Well, questions arise
because I am unsure how I would publishing to the web without re-generating SVG
output vs PNG for web vs PS for LaTeX. Definitely something I will need to
explore and for now I am sticking with the plan. Just had lunch and reflected
upon the fact that there is clearly a distinction between the results of your
computation and how you wish to publish them, and when. My feeling is that my
approach is acceptable in that the computation and generation of summary
results is definitely a separate goal from providing it in a particular
publishing format and surely more experience needs to be accumulated here.

Perhaps the simplest thing to do for greater flexibility is to:
- In =A=
  - Perform the computation
  - Capture the results of the computation
  - Produces images and so forth
- In =B=
  - Publish, convert, to a new format

The key questions are:
- May you?
  - Yes you may
- Should you?
  - Perhaps
  - It seems easier to separate concerns into computation and publishing/presentation

That is why evaluation is available on export, to capture aspects unique of
export itself, and *not* of the computation. To realize this, the operator must be
very thoughtful and aware of the execution model of the document. As it stands,
you may separate the time of execution of code blocks and also their results.
This is a subtle yet hugely important idea. You may utilize this feature and
idea anyway you please, but I will use it a certain way. All computational
evaluation and results storage will occur for source blocks in =A=. That is the
goal. However, we do not want that to occur for in-line source blocks in mode =A=.
That is possible and doable, but we do not want it because it would not stay
true to the original goal. Maintaining separation clearly, that normal source is
evaluated at execution time and inline-source is evaluated at publishing time
will make things crystal clear. This will make it easy for the operator of the
document to *see* the difference between results for =A= versus =B= because the latter
will never have its results stored within the source document.

A strict separation between the =A= and =B=, roughly computation and publish, must
be maintained. It is the only way to make sense of how to use =org= as a tool here.
One mode is responsible for computation, and the other is responsible for
publishing. All of the following configuration is performed in order to realize
this goal of A:computation vs B:publishing.

******* Putting the Pieces Together

Make it crystal clear that if the operator wants to evaluate source blocks then
she may do so. It is a fundamental right of every =org= mode user and the default
configuration shall allow it. If she wants restrictions, then they may easily be
added to the document itself.

#+begin_src emacs-lisp
(setq org-confirm-babel-evaluate nil)
(gcr/set-org-babel-default-header-args :eval "always")
#+end_src

Separate evaluation into two distinct phases or modes that of =A= for computation
and =B= for presentation/publishing/exportation (still unsure of the best name
given the existing terms both inside and outside of =org=).

During exportation, only evaluate inline source blocks.

#+begin_src emacs-lisp
(setq org-export-babel-evaluate 'inline-only)
#+end_src

During exportation, evaluate the blocks and replace the source blocks with the
resulting value. This gives you exactly what you would expect; the documents
look like plain old documents because they are exactly that.

#+begin_src emacs-lisp
(gcr/set-org-babel-default-inline-header-args :eval "always")
(gcr/set-org-babel-default-inline-header-args :results "value replace")
#+end_src

****** ℝ Specific

Always use the current ℝ session for evaluation.
#+begin_src emacs-lisp
(gcr/set-org-babel-default-header-args:R :session "*R*")
#+end_src

