.emacs.el

;; [[file:~/src/avi/avi.org::*Putting%20the%20Pieces%20Together][Putting\ the\ Pieces\ Together:1]]

(setq org-confirm-babel-evaluate nil)
(gcr/set-org-babel-default-header-args :eval "always")

;; Putting\ the\ Pieces\ Together:1 ends here

;; [[file:~/src/avi/avi.org::*Putting%20the%20Pieces%20Together][Putting\ the\ Pieces\ Together:1]]

(setq org-export-babel-evaluate 'inline-only)

;; Putting\ the\ Pieces\ Together:1 ends here

;; [[file:~/src/avi/avi.org::*Putting%20the%20Pieces%20Together][Putting\ the\ Pieces\ Together:1]]

(gcr/set-org-babel-default-inline-header-args :eval "always")
(gcr/set-org-babel-default-inline-header-args :results "value replace")

;; Putting\ the\ Pieces\ Together:1 ends here

;; [[file:~/src/avi/avi.org::*%E2%84%9D%20Specific][ℝ\ Specific:1]]

(gcr/set-org-babel-default-header-args:R :session "*R*")

;; ℝ\ Specific:1 ends here
