.emacs.el

;; [[file:~/src/avi/avi.org::*KOMA-Script][KOMA-Script:1]]

(eval-after-load 'ox '(require 'ox-koma-letter))

;; KOMA-Script:1 ends here

;; [[file:~/src/avi/avi.org::*KOMA-Script][KOMA-Script:1]]

(eval-after-load 'ox-koma-letter
  '(progn
     (add-to-list 'org-latex-classes
                  '("my-letter"
                    "\\documentclass[paper=letter, pagesize, fontsize=10pt, parskip]{scrlttr2}
\\usepackage[english]{babel}
\\usepackage[osf]{mathpazo}"))

     (setq org-koma-letter-default-class "my-letter")))

;; KOMA-Script:1 ends here

;; [[file:~/src/avi/avi.org::*KOMA-Script][KOMA-Script:1]]

(setq org-koma-letter-class-option-file "UScommercial9 KomaDefault")

;; KOMA-Script:1 ends here

;; [[file:~/src/avi/avi.org::*ispell][ispell:1]]

(add-to-list 'ispell-skip-region-alist '("^#\\+begin_src ". "#\\+end_src$"))

;; ispell:1 ends here

;; [[file:~/src/avi/avi.org::*ispell][ispell:1]]

(add-to-list 'ispell-skip-region-alist '("^#\\+BEGIN_SRC ". "#\\+END_SRC$"))

;; ispell:1 ends here

;; [[file:~/src/avi/avi.org::*ispell][ispell:1]]

(add-to-list 'ispell-skip-region-alist '("^#\\+begin_example ". "#\\+end_example$"))
(add-to-list 'ispell-skip-region-alist '("^#\\+BEGIN_EXAMPLE ". "#\\+END_EXAMPLE$"))

;; ispell:1 ends here

;; [[file:~/src/avi/avi.org::*ispell][ispell:1]]

(add-to-list 'ispell-skip-region-alist '("\:PROPERTIES\:$" . "\:END\:$"))

;; ispell:1 ends here

;; [[file:~/src/avi/avi.org::*ispell][ispell:1]]

(add-to-list 'ispell-skip-region-alist '("\\[fn:.+:" . "\\]"))

;; ispell:1 ends here

;; [[file:~/src/avi/avi.org::*ispell][ispell:1]]

(add-to-list 'ispell-skip-region-alist '("^http" . "\\]"))

;; ispell:1 ends here

;; [[file:~/src/avi/avi.org::*ispell][ispell:1]]

(add-to-list 'ispell-skip-region-alist '("=.*" . ".*="))

;; ispell:1 ends here

;; [[file:~/src/avi/avi.org::*ispell][ispell:1]]

(add-to-list 'ispell-skip-region-alist '("- \\*.+" . ".*\\*: "))

;; ispell:1 ends here

;; [[file:~/src/avi/avi.org::*ispell][ispell:1]]

(mapc (lambda (it)
        (gcr/ispell-a2isra (gcr/ispell-org-header-lines-regexp it)))
      '("ATTR_LATEX"
        "AUTHOR"
        "CREATOR"
        "DATE"
        "DESCRIPTION"
        "EMAIL"
        "EXCLUDE_TAGS"
        "HTML_CONTAINER"
        "HTML_DOCTYPE"
        "HTML_HEAD"
        "HTML_HEAD_EXTRA"
        "HTML_LINK_HOME"
        "HTML_LINK_UP"
        "HTML_MATHJAX"
        "INFOJS_OPT"
        "KEYWORDS"
        "LANGUAGE"
        "LATEX_CLASS"
        "LATEX_CLASS_OPTIONS"
        "LATEX_HEADER"
        "LATEX_HEADER_EXTRA"
        "OPTIONS"
        "SELECT_TAGS"
        "STARTUP"
        "TITLE"))

;; ispell:1 ends here
