avi.org
**** Hooks

Configure =org= mode hooks to make it easy to do the most commonly performed
operations.

Bit of a mystery that I couldn't =local-set-key= with one particular binding.
Found a way that /does/ work with the help of Jorge and Peak. I'm OK with it
remaining a mystery for now.

#+begin_src emacs-lisp
(define-key org-mode-map (kbd "C-,") (lambda () (interactive) (insert " \\larr ")))
#+end_src

Started questioning why after hitting RETURN while in lists I have to hit TAB to
get indented properly. Kind of a dead giveaway that I should be
return-and-indenting! Looked at =org-return= to find that it has an argument
about indenting and then saw that =org-return-indent= passes it for you. With that
in mind, RETURN is bound to that now. Now ALEC has four different kinds of
"returns" in Org in order of likelihood of usage:
- org-return-indent :: Make it really easy to work in existing list items,
  headings, and tables
  - This is listed first because I often go back to modify entries
  - <return> because it is used the most
- org-meta-return :: Make it really easy to add new list items, headings, and
  table contents
  - M-<return> because the binding comes with Org
- electric-indent-just-newline :: For when I want to break out of the default
  Org indentation to start working at the beginning of the line for example when
  I'm done working in a list or have just created a new heading
  - C-M-<return> because it is next step "lower" in the binding
- gcr/smart-open-line :: When I want to insert a new line between the current
  and next line then position the cursor correctly indented at the start of it.
  - s-<return> because it is that is the last place in the modifier key chain

#+begin_src emacs-lisp
(defun gcr/org-mode-hook ()
  (local-set-key (kbd "C-;") 'gcr/vc-next-action)
  (local-set-key (kbd "<return>") 'org-return-indent)
  (local-set-key (kbd "C-M-<return>") 'electric-indent-just-newline)
  (local-set-key (kbd "C-1") 'org-narrow-to-subtree)
  (local-set-key (kbd "M-1") 'widen)
  (local-set-key (kbd "C-2") 'gcr/org-edit-src-code-plus-name)
  (local-set-key (kbd "C-3") 'org-table-edit-field)
  (local-set-key (kbd "s-h") 'org-babel-check-src-block)
  (local-set-key (kbd "s-i i") 'org-babel-insert-header-arg)
  (local-set-key (kbd "s-j") 'org-babel-previous-src-block)
  (local-set-key (kbd "s-k") 'org-babel-next-src-block)
  (local-set-key (kbd "s-l") 'org-babel-demarcate-block)
  (local-set-key (kbd "s-;") 'org-babel-view-src-block-info)
  (local-set-key (kbd "s-b x") 'org-babel-expand-src-block)
  (local-set-key (kbd "s-b s") 'org-babel-switch-to-session)
  (local-set-key (kbd "s-b c") 'org-babel-switch-to-session-with-code)
  (local-set-key (kbd "s-o") 'org-babel-execute-maybe)
  (local-set-key (kbd "s-t") 'org-babel-tangle)
  (local-set-key (kbd "s-x") 'org-babel-do-key-sequence-in-edit-buffer)
  (local-set-key (kbd "s-w w") 'org-export-dispatch)
  (local-set-key (kbd "s-<f5>") 'org-babel-execute-buffer)
  (local-set-key (kbd "s-i d") 'org-display-inline-images)
  (local-set-key (kbd "s-i r") 'org-remove-inline-images)
  (local-set-key (kbd "C-.") (lambda () (interactive) (insert " \\rarr ")))
  (local-set-key (kbd "$") 'yf/org-electric-dollar)
  (when (and (fboundp 'guide-key-mode) guide-key-mode)
    (guide-key/add-local-guide-key-sequence "C-c")
    (guide-key/add-local-guide-key-sequence "C-c C-x")
    (guide-key/add-local-highlight-command-regexp "org-")))

(add-hook 'org-mode-hook 'gcr/org-mode-hook)
#+end_src

Configure the =org= =babel= source code editing buffer with a key to make it
easy to exit. This is consistent with the approach of "same to exit as enter".

#+begin_src emacs-lisp
(defun gcr/org-src-mode-hook ()
  (local-set-key (kbd "C-2") 'org-edit-src-exit)
  (visual-line-mode))

(add-hook 'org-src-mode-hook 'gcr/org-src-mode-hook)
#+end_src

* TODO User Experience (UX)

AVI provides complete and total distraction free operation. Information is fine
as long as it has to do with files. AVI is only going to work with files and
provide information about them. This holds true to her file-based worldview.

** TODO Communications  & Media

1) IRC will be in another application
2) Email will be in another application
3) Playing music will be in another application

** TODO Colors

1) Choose "quiet" tones that minimize eye strain

** TODO Font

*** TODO Introduction

Choosing my font for ALEC has been a journey. Gosh, that is a very serious word.
It has been a /learning experience/. I never questioned font choice before. Font
design is an art form. Font choice is an art form, too. I learned something.

The purpose of this document is to capture parts of that journey that I valued.

*** TODO Audience

- Computer
  - Users
  - Programmers
  - User experience designers (UXD)
- Non-Computer
  - Readers

Every computer-user has a different strategy for choosing the best font for long
periods working at the computer. They all involve many metrics, strategies, and
rubrics. Based on that, they are probably all wrong. Well not really, they are
right based upon experience, and experience is really all that matters.

Non-computer users are important too. I am one. I love being able to sent a
printed letter for /important things/. I love being able to read when /not/ at a
computer. This journey helped reveal that for me.

I was curious about whether my experience had any basis in reality, and I really
wanted to dig into what is the "right way" to choose a font for any particular
user or situation. The following are notes and ultimately a decision on what is
the best for me. Hopefully the notes alone are revealing and help you reach your
own conclusion, too. At the very least you ought to be educated, informed, and
probably surprised, too, about some of the factors involved in font selection.

*** TODO Resources

I started researching fonts using Internet search engines. I found a bunch of
resources. I read all of them and took notes. This heading captures addresses to
those resources and notes about them.

**** [[http://thenextweb.com/dd/2011/03/02/whats-the-most-readable-font-for-the-screen/][What’s the most readable font for the screen?]]

Serifs are tips for the reader's eyes for flow.

San-serifs are better for low-res.

Simultaneously states that is no difference between serif and san-serif.

Rec: Helvetica/Arial

Comment recommendations:

Designed for digital, Hermann Zapf's Optima, or as a backup Verdana

Designed for digital, Open Sans

Both, Calibri

San-serifs are easier on the eyes as you get older, citing retinal tears
specifically

**** [[http://www.webpagecontent.com/arc_archive/182/5/][Time to change your fonts]]

Designed for screen: Verdana, Trebuchet MS, and (the serif) Georgia.

Easy to read, available on virtually all machines.

Let go of times new roman, Arial, and Helvetica.

Traditionally a serif font was used for the main body of a document, and
sans-serif for headings. Today, those principles are often reversed.

**** [[http://www.awaionline.com/2011/10/the-best-fonts-to-use-in-print-online-and-email/][The Best Fonts to Use in Print, Online, and Email]]

Popular serif fonts are Times New Roman, Palatino, Georgia, Courier,
Bookman and Garamond.

Some popular San Serif fonts are Helvetica, Arial, Calibri, Century
Gothic and Verdana.

It's been said that serif fonts are for "readability," while sans-serif
fonts are for "legibility."

Best fonts for online: go with sans-serif.

2002 study by the Software Usability and Research Laboratory:
- The most legible fonts were Arial, Courier, and Verdana.
- At 10-point size, participants preferred Verdana. Times New Roman was
  the least preferred.
- At 12-point size, Arial was preferred and Times New Roman was the
  least preferred.
- The preferred font overall was Verdana, and Times New Roman was the
  least preferred.

For easiest online reading, use Arial 12-point size and larger. If
you're going smaller than 12 points, Verdana at 10 points is your best
choice. If you're after a formal look, use the font "Georgia." And for
older readers, use at least a 14-point font.

Dr. Ralph F. Wilson, an e-commerce consultant, did a series of tests in
2001. He also came to the conclusion that the sans-serif fonts are more
suited to the computer screen.Some of the highlights of the test results
were that at 12 points, respondents showed a preference for Arial over
Verdana -- 53% to 43% (with 4% not being able to distinguish between the
two).Two-thirds of respondents found that Verdana at 12 points was too
large for body text, but Verdana at 10 points was voted more readable
than Arial at 10 points by a 2 to 1 margin.In conclusion, for the best
font readability, use Arial 12 point or Verdana at 10 points and 9
points for body text. For headlines, he suggests using larger bold
Verdana.

Comments: Good.

My comments: no links to cited papers

**** [[https://tex.stackexchange.com/questions/20149/which-font-is-the-most-comfortable-for-on-screen-viewing][Which font is the most comfortable for on-screen viewing?]]

Post: Advice to use san-serif is outdated and inappropriate for today's
high resolution screens. San-serif or not is irrelevant; instead the
measure of success is to use a large font that was specifically designed
for on-screen usage. For inspiration, look at the free fonts listed at
the Google Web Fonts directory, especially Vollkorn or the Droid Serif
font which was particularly developed with small font size in mind.

GCR: That post is confusing because he later explains that we are not
there yet, but rather getting close.

Post: Sans-serif are best for on-screen.

**** [[http://www.google.com/fonts/specimen/Vollkorn][Vollkorn]]

**** [[http://www.google.com/fonts/specimen/Droid+Serif][Droid Serif]]

**** [[http://river-valley.zeeba.tv/minion-math-a-new-math-font-family/][The Design of a New Math Font Family]]

Interesting.

**** [[http://edutechwiki.unige.ch/en/Font_readability][Font readability]]

Legibility refers to being able to read a text in bad conditions.
“Legibility is concerned with the very fine details of typeface design,
and in an operational context this usually means the ability to
recognize individual letters or words. Readability however concerns the
optimum arrangement and layout of whole bodies of text”

Studies that contrast serif vs. non-serif fonts seem to be
controversial.

There are some ground rules one can find, like:
- Don't make long lines nor too long paragraphs
- Use wide fonts such as Palatino or Verdana for small fonts
- Use spaces between lines, e.g. about 1.2 at least. E.g. in Word 2007,
  1.15 is the default I believe. to be controversial.

Sans serif: Verdana (a humanist font) or Arial

Serif: Georgia

Some references for studies and research done on fonts.

“two roles for type: a functional role (relating to legibility) and an
aesthetic/semantic role, which impacts the "apparent 'fitness' or
'suitability' for different functions, and which imbue it with the power
to evoke in the perceiver certain emotional and cognitive response" (p.
38)””

In her study: Calibri came out as a winner against Courier New and Curlz.

GCR: Very exciting and interesting with good links

**** [[http://usabilitynews.org/the-effect-of-typeface-on-the-perception-of-email/][The Effect of Typeface on the Perception of Email]]

People take Calibri seriously via this study.

**** [[http://usabilitynews.org/know-your-typefaces-semantic-differential-presentation-of-40-onscreen-typefaces/][Know Your Typefaces! Semantic Differential Presentation of 40 Onscreen Typefaces]]

Study showing how people emotionally react to certain fonts.

**** [[http://typoface.blogspot.com/2009/08/academic-base.html][The Academic Evidence Base for Typeface Readability]]

Study.

Young people like serif; older like sans-serif.

**** [[http://liinwww.ira.uka.de/bibliography/Typesetting/reading.html][Bibliography on font readability]]

Links to papers on font readability.

**** [[http://www.kathymarks.com/archives/2006/11/best_fonts_for_the_web_1.html][Best Fonts for the Web]]

Serif: Georgia. It was designed especially for screen. Other options are
listed.

Sans-Serif: Tahoma. Geneva, Tahoma, and Verdana were designed especially
for the screen. Tahoma in particular is cited for legibility. Another
pick: Lucida Sans Unicode: Cited as remarkably legible for some reason.

Monospaced: Monaco/Lucida Console.

GCR: Great article.

**** [[http://psychology.wichita.edu/surl/usabilitynews/52/uk_font.htm][A Comparison of Two Computer Fonts: Serif versus Ornate Sans Serif]]

Another study, unsure what to conclude from it.

**** [[http://usabilitynews.org/a-comparison-of-popular-online-fonts-which-size-and-type-is-best/][A Comparison of Popular Online Fonts: Which Size and Type is Best?]]

Excellent details.

Tahoma and Verdana, sans-serifs, were designed specifically for viewing
on computer screens. J, I, and 1 were made distinguishable. Tahoma is
wider than Verdana.

Great article but leaves so many questions and stuff unanswered and
explored.

**** [[http://usabilitynews.org/a-comparison-of-popular-online-fonts-which-is-best-and-when/][A Comparison of Popular Online Fonts: Which is Best and When?]]

Big fonts generally don't matter and are easy to read.

Tahoma is well-read.

Verdana and Georgia have good legibility.

Whole other range of evaluations: personality, elegant, youthful and
fun, business-like,

Most legible: Courier, Comic, Verdana, Georgia, and Times.

