.emacs.el

;; [[file:~/src/avi/avi.org::*Package%20&%20Use-Package][Package\ &\ Use-Package:1]]

(package-initialize)

;; Package\ &\ Use-Package:1 ends here

;; [[file:~/src/avi/avi.org::*Package%20&%20Use-Package][Package\ &\ Use-Package:1]]

(add-to-list 'package-archives
             '("melpa" . "http://melpa.org/packages/") t)

;; Package\ &\ Use-Package:1 ends here

;; [[file:~/src/avi/avi.org::*Package%20&%20Use-Package][Package\ &\ Use-Package:1]]

(add-to-list 'package-archives
             '("gnu" . "http://elpa.gnu.org/packages/"))

;; Package\ &\ Use-Package:1 ends here

;; [[file:~/src/avi/avi.org::*Package%20&%20Use-Package][Package\ &\ Use-Package:1]]

(defun gcr/warn-use-package ()
  "Report use-package misconfiguration."
  (interactive)
  (unless (package-installed-p 'use-package)
    (warn "Please install 'use-package by hand. To do so, run `list-packages', search for it, position the cursor on it, and install it by typing `i', `x', 'yes', and finally restart EMACS.")))
(gcr/warn-use-package)
(require 'use-package)

;; Package\ &\ Use-Package:1 ends here

;; [[file:~/src/avi/avi.org::*Org-Mode%20Post-Provisioning][Org-Mode\ Post-Provisioning:1]]

(use-package ob-sml
             :ensure t
             :config
             (require 'ob-sml nil 'noerror)
             (add-to-list 'org-babel-load-languages
                          '(sml . t)))

;; Org-Mode\ Post-Provisioning:1 ends here
